// FileSyncAgent Localizable.strings

// The name of the product
"FileSyncAgent" = "File Sync";

// Text of "ok" button, used in various dialogs.
"OK" = "OK";

// Text of "cancel" button, used in various dialogs.
"CANCEL" = "Cancel";

// Text of "Next" button, used in various dialogs
"NEXT" = "Next";

// Text of "Done" button, used in various dialogs
"DONE" = "Done";

// Text of "Continue" button, used in various dialogs
"CONTINUE" = "Continue";

// The name of iDisk disk image when renamed and moved to the desktop when iDisk syncing is disabled.
// The argument is the user's .Mac name.
// The optional second argument is a counter, for when a .dmg already exists. E.g. "Previous local iDisk for jholt 3.dmg"
"PREVIOUS DMG%"    = "Previous local iDisk for %@";
"PREVIOUS DMG DIR" = "Previous local iDisks";

// These strings are used after migrating a Tiger local iDisk image to Leopard (and later) iDisk syncing  [rdar://6607831]
"MIGRATION_COMPLETE" = "There's an old copy of your local iDisk on this computer that uses %@ of disk space. Would you like to keep it or move it to the Trash?";
"MIGRATION_DESKTOP"  = "Keep";
"MIGRATION_TRASH"    = "Move to Trash";

// These strings are used to ask the user what to do with old and orphaned local iDisk images from all versions of iDisk syncing.  [rdar://6232713]
// Images can be found on the Desktop (moved there when iDisk syncing has been turned off in the past), as well as ~/Library/Mirrors (Tiger) and ~/Libary/FileSync (Leopard+)
// The code tracks where the images are found and presents three variants depending on where the images are (~/Desktop and/or ~/Library (i.e., INTERNAL)
"CLEANUP_IMAGES_DESK_1"         = "There's an old copy of your local iDisk on this computer that uses %@ of disk space. Would you like to keep it or move it to the Trash?";
"CLEANUP_IMAGES_INTERNAL_1"     = "There's an old copy of your local iDisk on this computer that uses %@ of disk space. Would you like to keep it or move it to the Trash?";
"CLEANUP_IMAGES_DESK_MULTI"     = "There are several old copies of your local iDisk on this computer that use %@ of disk space. Would you like to keep them or move them to the Trash?";
"CLEANUP_IMAGES_INTERNAL_MULTI" = "There are several old copies of your local iDisk on this computer that use %@ of disk space. Would you like to keep them or move them to the Trash?";
"CLEANUP_IMAGES_ALL"            = "There are several old copies of your local iDisk on this computer that use %@ of disk space. Would you like to keep them or move them to the Trash?";

"CLEANUP_TITLE_1"     = "Another copy of your iDisk was found on your computer.";
"CLEANUP_TITLE_MULTI" = "Other copies of your iDisk were found on your computer.";

"Keep"  = "Keep";
"Trash" = "Move to Trash";

// ----------------------------------
// "Your iDisk is almost full" dialog

"IDISK ALMOST FULL" = "Your iDisk is almost full.";

// Text of the "warn again" checkbox.
"DO NOT WARN AGAIN" = "Do not show this warning again.";

// Trash has files, too.
"ALMOST FULL TRASH MSG" = "There are files on your iDisk that are in the Trash. To make more space available, empty the Trash.\n\nYou can increase the size of your iDisk by going to the %@ pane of System Preferences.";

// No files in trash.
"ALMOST FULL .MAC MSG" = "You can increase the size of your iDisk by going to the %@ pane of System Preferences.";


// ----------------------------
// "Resizing your iDisk" dialog

"RESIZE IDISK"     = "The size of the iDisk on your computer needs to be adjusted.";
"RESIZE IDISK MSG" = "The iDisk on your computer will be temporarily unavailable while changing its size.";


// ----------------------------------
// "Can't turn off your iDisk" dialog

"CANT DISABLE"          = "Unable to turn off your Local iDisk.";
"CANT DISABLE BUSY MSG" = "Your local iDisk can’t be disabled right now because it contains files which are open. Please close the files and try again.";
"CANT DISABLE ERR MSG%" = "Your local iDisk can’t be disabled right now because error %d occurred. Please try again later.";


// ---------------------------
// "log out / continue" dialog

"LOGOUT BUSY"     = "Your iDisk is being synced. Would you like to continue or log out?";
"LOGOUT BUSY MSG" = "You can log out after your iDisk is synced.";

// Text of the "log out" button.
"LOGOUT" = "Log Out";

// Text of the "continue" button.
"CONTINUE SYNC" = "Continue Sync";


// Size formats, used in the conflict and exception dialog to show file sizes.
// The argument is the number of bytes, the suffixes are the abbreviations for the standard metric scales: kilobytes, megabytes, etc.
"%BYTES" = "%qu bytes";
"%KB"    = "%.2f KB";
"%MB"    = "%.2f MB";
"%GB"    = "%.2f GB";
"%TB"    = "%.2f TB";
"%PB"    = "%.2f PB";
"%XB"    = "%.2f XB";


// ----------------------------------
// Finder status messages

"Cleaning up..."                 = "Cleaning up…";
"Last sync cancelled."           = "Last sync canceled.";
"Finder Settings"                = "Finder Settings";				// [rdar://4735199]

// "DM_ACCOUNT_EXPIRED" was "Your %@ account has expired." prior to 10.5.3
"DM_ACCOUNT_EXPIRED"             = "Your %@ account has expired.";
"CREATE FAILED:NIL DMA"          = "Unable to turn on iDisk syncing. Please check your %@ username and password in the %@ System Preferences pane.";
"CREATE FAILED:NO USERNAME"      = "Unable to turn on iDisk syncing. Please check your %@ username and password in the %@ System Preferences pane.";
"CREATE FAILED:TOO BIG"          = "Unable to turn on iDisk syncing. Your iDisk is larger than the free space available.";
"CREATE FAILED:UNKNOWN"          = "Unable to turn on iDisk syncing. Please try again later.";
"Cannot sync more than one computer at a time."	= "Another computer is currently syncing with this account. Please try again later.";
"iDisk syncing unavailable."					= "iDisk syncing is currently unavailable. Please try again later.";

// Was not localized prior to 10.5.3 (oops!)
"NO_ACTIVE_IDISK"                = "Your %@ account does not have an active iDisk.";
